# Задача-1:
# Дан список, заполненный произвольными целыми числами, получите новый список,
# элементами которого будут квадратные корни элементов исходного списка,
# но только если результаты извлечения корня не имеют десятичной части и
# если такой корень вообще можно извлечь
# Пример: Дано: [2, -5, 8, 9, -25, 25, 4]   Результат: [3, 5, 2]

# Решение 1
# from math import sqrt
#
# lst = [2, -5, 8, 9, -25, 25, 4]
# lst2 = []
#
# for i in range(len(lst)):
#     try:
#         m = sqrt(lst[i])
#     except:
#         pass
#     else:
#         if m.is_integer():
#             lst2.append(int(m))
#
# print(lst2)

# Задача-2: Дана дата в формате dd.mm.yyyy, например: 02.11.2013.
# Ваша задача вывести дату в текстовом виде, например: второе ноября 2013 года.
# Склонением пренебречь (2000 года, 2010 года)

# Решение 1
# days = {
#     "01": "первое",
#     "02": "второе",
#     "03": "третье",
#     "04": "четвертое",
#     "05": "пятое",
#     "06": "шестое",
#     "07": "седьмое",
#     "08": "восьмое",
#     "09": "девятое",
#     "10": "десятое",
#     "11": "одиннадцатое",
#     "12": "двинадцатое",
#     "13": "тринадцатое",
# }
# months = {
#     "01": "января",
#     "02": "февраля",
#     "03": "марта",
#     "04": "апреля",
#     "05": "мая",
#     "06": "июня",
#     "07": "июля",
#     "08": "августа",
#     "09": "сентября",
#     "10": "октября",
#     "11": "ноября",
#     "12": "декабря"
# }
#
# sample = "02.11.2013".split(".")
#
# if sample[0] in days: print(days[sample[0]], end=" ")
# if sample[1] in months: print(months[sample[1]], end=" ")
#
# print(sample[2] + " года", end="")

# Задача-3: Напишите алгоритм, заполняющий список произвольными целыми числами
# в диапазоне от -100 до 100. В списке должно быть n - элементов.
# Подсказка:
# для получения случайного числа используйте функцию randint() модуля random

# Решение 1
# col = int(input("Введите размер списка:"))
#
#
# def list_generator(a):
#     from random import randint
#     lst = []
#     for i in range(a):
#         lst.append(randint(-100, 100))
#     return lst

# Задача-4: Дан список, заполненный произвольными целыми числами.
# Получите новый список, элементами которого будут: 
# а) неповторяющиеся элементы исходного списка:
# например, lst = [1, 2, 4, 5, 6, 2, 5, 2], нужно получить lst2 = [1, 2, 4, 5, 6]
# б) элементы исходного списка, которые не имеют повторений:
# например, lst = [1 , 2, 4, 5, 6, 2, 5, 2], нужно получить lst2 = [1, 4, 6]

# Решение 1
source = [1, 2, 4, 5, 6, 2, 5, 2]
lst = set(source)
print(lst)

lst2 = []
for i in lst:
    if source.count(i) == 1:
        lst2.append(i)
print(lst2)
